/**
  ******************************************************************************
  * @file    main.c
  * @brief   测试tim2四个通道输出不同占空比的pwm波
  * 实验平台:Crazepony(STM32T8U6)
  *
  ******************************************************************************
  */  
#include "stm32f10x.h"
#include "bsp_pwm_output.h"

/**
  * @brief  主函数
  * @param  无  
  * @retval 无
  */
int main(void)
{	
	
	/* TIM2 PWM波输出初始化，并使能TIM2 PWM输出 */
	TIM2_PWM_Init();
	
	while (1)
	{

	}
}
/*********************************************END OF FILE**********************/
